#+TITLE: Wikipedia Plots

This is just a small little project that tries to summarise the Wikipedia articles that consist of a day of the year (e.g. [[https://en.wikipedia.org/wiki/January_12][January 12]]). Each one of these 366 articles lists years where:

1. A significant event happened (e.g. 1895, /The National Trust is founded in the United Kingdom/)
2. Someone is born (e.g. 1772, /Mikhail Speransky/, Russian academic and politician)
3. Someone dies (e.g. 1665, /Pierre de Fermat/, French mathematician and lawyer)

The following plots summarize Births/Deaths, and Events to see if there are any significant months (12) or days (31) that can claim a bias in any of the above three types. 

*** Initialise and Filter Datasets

   #+begin_src R :session yes
     library(ggplot2)
     library(gridExtra)
     library(lattice)
     library(grid)
     library(gtable)

     ## Reformat CSV to Data.Frame
     tab <- read.csv("daysToYearsMap_superwide2.csv",
                     row.names=1,
                     stringsAsFactors = F, sep = ",")

     tab$Month <- factor(sub("(^...).*_\\d*", "\\1", tab$Date), # sub("(.*)_\\d*", "\\1", tab$Date),
                         levels=c("Jan", "Feb", "Mar", "Apr", "May",
                                  "Jun", "Jul", "Aug", "Sep", "Oct",
                                  "Nov", "Dec"))
     tab$Day <- factor(as.integer(sub(".*_(\\d*)", "\\1", tab$Date)),
                       levels=seq(1,31))

     #### Sub Datasets ####
     sub.all <- tab
     sub.all.t100v100 <- tab[tab$Year < 100 & tab$Year > -100,]
     sub.all.am100 <- tab[tab$Year > -100,]
     sub.all.a1900 <- tab[tab$Year > 1900,]
     sub.all.a2000 <- tab[tab$Year > 2000,]
     sub.all.b1000 <- tab[tab$Year < 1000,]
     sub.all.b0 <- tab[tab$Year < 0,]
     #
     sub.bd <- tab[tab$Type %in% c("Births","Deaths"),]
     sub.bd.t100v100 <- sub.bd[sub.bd$Year < 100 & sub.bd$Year > -100,]
     sub.bd.a1900 <- sub.bd[sub.bd$Year > 1900,]
     sub.bd.a2000 <- sub.bd[sub.bd$Year > 2000,]
     sub.bd.b1000 <- sub.bd[sub.bd$Year < 1000,]
     sub.bd.b0 <- sub.bd[sub.bd$Year < 0,]
     #
     sub.ev <- tab[tab$Type=="Events",]
     sub.ev.t100v100 <- sub.ev[sub.ev$Year < 100 & sub.ev$Year > -100,]
     sub.ev.a1900 <- sub.ev[sub.ev$Year > 1900,]
     sub.ev.a2000 <- sub.ev[sub.ev$Year > 2000,]
     sub.ev.b1000 <- sub.ev[sub.ev$Year < 1000,]
     sub.ev.b0 <- sub.ev[sub.ev$Year < 0,]

     dim(sub.ev)

   #+end_src

   #+RESULTS:
   | 17676 |
   |     5 |

